app/controllers/measurements_controller.rb

  def index
    @measurements = current_user.measurements.with_units.order(created_at: :desc)
    data = @measurements.group_by { |measurement| measurement.unit.title }
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."user_id" = $1 ORDER BY "measurements"."created_at" DESC  [["user_id", 1]]
SELECT "units".* FROM "units" WHERE "units"."id" = $1  [["id", 1]]

  def create
    unit = Unit.find(params[:unit_id])
    @measurement = unit.measurements.build(measurement_params)
    @measurement.user = current_user

    if @measurement.save
---
SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "measurements" ("unit_id", "user_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["unit_id", 1], ["user_id", 1], ["value", 0.0], ["created_at", "2021-08-23 09:05:30.515328"], ["updated_at", "2021-08-23 09:05:30.515328"]]